#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
heroku_app.api: Refreshing state... [id=adtest-recipe-app-api]
heroku_addon.database: Refreshing state... [id=55f3abdf-e979-4c95-b7ec-e13b999a49ba]
heroku_build.api: Refreshing state... [id=b26c4a37-c132-4691-90d1-ad3aeb6f30c6]
heroku_formation.api: Refreshing state... [id=4eed8fca-5954-455e-a770-5554e7e2664e]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # heroku_build.api has been changed
  ~ resource "heroku_build" "api" {
        id                = "b26c4a37-c132-4691-90d1-ad3aeb6f30c6"
      ~ output_stream_url = "https://build-output.heroku.com/streams/f4/f4355849-909b-42b9-833f-ef8260379e4f/logs/b2/b26c4a37-c132-4691-90d1-ad3aeb6f30c6.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20210813%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20210813T094236Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=2e2a8935e39decd60899ecad0ecbe5a7f0582415bd809bee5d051a9624b864fa" -> "https://build-output.heroku.com/streams/f4/f4355849-909b-42b9-833f-ef8260379e4f/logs/b2/b26c4a37-c132-4691-90d1-ad3aeb6f30c6.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20210815%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20210815T080238Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=0985ccf8d7294442cd263b11870a3141b1d5a17613653cd0b7b1d59d172d7ea7"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # heroku_build.api must be replaced
-/+ resource "heroku_build" "api" {
      ~ id                = "b26c4a37-c132-4691-90d1-ad3aeb6f30c6" -> (known after apply)
      ~ local_checksum    = "SHA256:07058410aa8c3ceadb4a67ba0b41a4eba1c6c8b3d9e13e63bb0e17e02411d231" -> "SHA256:07a822ae8c8d74abf86fc8afc066bfdda5df119de5ef405b2ac44578fa4369b2" # forces replacement
      ~ output_stream_url = "https://build-output.heroku.com/streams/f4/f4355849-909b-42b9-833f-ef8260379e4f/logs/b2/b26c4a37-c132-4691-90d1-ad3aeb6f30c6.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20210815%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20210815T080238Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=0985ccf8d7294442cd263b11870a3141b1d5a17613653cd0b7b1d59d172d7ea7" -> (known after apply)
      ~ release_id        = "60ae2b4b-9d9e-4eef-80ef-d1e1fd1586ae" -> (known after apply)
      ~ slug_id           = "531e697d-2ea3-4a45-8a65-024a89497504" -> (known after apply)
      ~ stack             = "heroku-20" -> (known after apply)
      ~ status            = "succeeded" -> (known after apply)
      ~ user              = [
          - {
              - email = "n13m4n0@gmail.com"
              - id    = "692ce5d5-b009-41f5-8e30-daa6b6ae9b7b"
            },
        ] -> (known after apply)
      ~ uuid              = "b26c4a37-c132-4691-90d1-ad3aeb6f30c6" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ source {
          + checksum = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @noVerity, Action: `pull_request`, Working Directory: ``, Workflow: `Plan Terraform`*